espressif/esp-idf/components/esp_hal_ledc/esp32p4/include/hal/ledc_ll.h
/*
 * SPDX-FileCopyrightText: 2023-2026 Espressif Systems (Shanghai) CO LTD
 *
 * SPDX-License-Identifier: Apache-2.0
 */

// The LL layer for LEDC register operations.
// Note that most of the register operations in this layer are non-atomic operations.

#pragma once

#include <stddef.h>
#include "hal/assert.h"
#include "hal/ledc_types.h"
#include "soc/ledc_struct.h"
#include "soc/ledc_reg.h"
#include "soc/clk_tree_defs.h"
#include "soc/hp_sys_clkrst_struct.h"
#include "soc/soc_caps.h"
#include "soc/soc_etm_source.h"

#define LEDC_LL_GET(attr)                  (LEDC_LL_ ## attr)

#define LEDC_LL_GET_HW(group_id)           ((group_id == 0) ? &LEDC : NULL)

#define LEDC_LL_GROUP_NUM                  (1)
#define LEDC_LL_CHANNEL_SUPPORT_OVF_CNT     1

#define LEDC_LL_DUTY_NUM_MAX       (LEDC_CH0_GAMMA_RANGE0_DUTY_NUM_V)
#define LEDC_LL_DUTY_CYCLE_MAX     (LEDC_CH0_GAMMA_RANGE0_DUTY_CYCLE_V)
#define LEDC_LL_DUTY_SCALE_MAX     (LEDC_CH0_GAMMA_RANGE0_SCALE_V)
#define LEDC_LL_HPOINT_VAL_MAX     (LEDC_HPOINT_CH0_V)
#define LEDC_LL_OVF_CNT_MAX        (LEDC_OVF_NUM_CH0_V + 1)
#define LEDC_LL_FRACTIONAL_BITS    (8)
#define LEDC_LL_FRACTIONAL_MAX     ((1 << LEDC_LL_FRACTIONAL_BITS) - 1)
#define LEDC_LL_GLOBAL_CLOCKS      SOC_LEDC_CLKS

/// Get the mask of the duty change end interrupt status register.
#define LEDC_LL_DUTY_CHANGE_END_INTR_MASK(speed_mode)  (0xffUL << LEDC_DUTY_CHNG_END_CH0_INT_ENA_S)

#define LEDC_LL_EVENT_CHANNEL_DUTY_CHANGE_END(speed_mode, channel)  BIT(LEDC_DUTY_CHNG_END_CH0_INT_ENA_S + (channel))
#define LEDC_LL_EVENT_CHANNEL_OVF_CNT(speed_mode, channel)          BIT(LEDC_OVF_CNT_CH0_INT_ENA_S + (channel))
#define LEDC_LL_EVENT_CHANNEL_MASK(speed_mode, channel)             (LEDC_LL_EVENT_CHANNEL_DUTY_CHANGE_END(speed_mode, channel) | LEDC_LL_EVENT_CHANNEL_OVF_CNT(speed_mode, channel))

// Channel tasks: ID, enable register and bit
#define LEDC_LL_ETM_CHANNEL_TASK_ID(group, channel, task) \
    ((uint32_t [1][LEDC_CHANNEL_ETM_TASK_MAX]){{ \
        [LEDC_CHANNEL_ETM_TASK_FADE_SCALE_UPDATE] = LEDC_TASK_DUTY_SCALE_UPDATE_CH0, \
        [LEDC_CHANNEL_ETM_TASK_SIG_OUT_DIS]      = LEDC_TASK_SIG_OUT_DIS_CH0, \
        [LEDC_CHANNEL_ETM_TASK_OVF_CNT_RST]      = LEDC_TASK_OVF_CNT_RST_CH0, \
        [LEDC_CHANNEL_ETM_TASK_FADE_RESTART]     = LEDC_TASK_GAMMA_RESTART_CH0, \
        [LEDC_CHANNEL_ETM_TASK_FADE_PAUSE]       = LEDC_TASK_GAMMA_PAUSE_CH0, \
        [LEDC_CHANNEL_ETM_TASK_FADE_RESUME]      = LEDC_TASK_GAMMA_RESUME_CH0, \
    }}[(group)][(task)] + (channel))

#define LEDC_LL_ETM_CHANNEL_TASK_EN_REG(group, task) \
    ((volatile uint32_t *[1][LEDC_CHANNEL_ETM_TASK_MAX]){{ \
        [LEDC_CHANNEL_ETM_TASK_FADE_SCALE_UPDATE] = (volatile uint32_t *)LEDC_EVT_TASK_EN0_REG, \
        [LEDC_CHANNEL_ETM_TASK_SIG_OUT_DIS]      = (volatile uint32_t *)LEDC_EVT_TASK_EN1_REG, \
        [LEDC_CHANNEL_ETM_TASK_OVF_CNT_RST]      = (volatile uint32_t *)LEDC_EVT_TASK_EN1_REG, \
        [LEDC_CHANNEL_ETM_TASK_FADE_RESTART]     = (volatile uint32_t *)LEDC_EVT_TASK_EN2_REG, \
        [LEDC_CHANNEL_ETM_TASK_FADE_PAUSE]       = (volatile uint32_t *)LEDC_EVT_TASK_EN2_REG, \
        [LEDC_CHANNEL_ETM_TASK_FADE_RESUME]      = (volatile uint32_t *)LEDC_EVT_TASK_EN2_REG, \
    }}[(group)][(task)])

#define LEDC_LL_ETM_CHANNEL_TASK_EN_BIT(group, channel, task) \
    ((uint32_t [1][LEDC_CHANNEL_ETM_TASK_MAX]){{ \
        [LEDC_CHANNEL_ETM_TASK_FADE_SCALE_UPDATE] = BIT(LEDC_TASK_DUTY_SCALE_UPDATE_CH0_EN_S), \
        [LEDC_CHANNEL_ETM_TASK_SIG_OUT_DIS]      = BIT(LEDC_TASK_SIG_OUT_DIS_CH0_EN_S), \
        [LEDC_CHANNEL_ETM_TASK_OVF_CNT_RST]      = BIT(LEDC_TASK_OVF_CNT_RST_CH0_EN_S), \
        [LEDC_CHANNEL_ETM_TASK_FADE_RESTART]     = BIT(LEDC_TASK_GAMMA_RESTART_CH0_EN_S), \
        [LEDC_CHANNEL_ETM_TASK_FADE_PAUSE]       = BIT(LEDC_TASK_GAMMA_PAUSE_CH0_EN_S), \
        [LEDC_CHANNEL_ETM_TASK_FADE_RESUME]      = BIT(LEDC_TASK_GAMMA_RESUME_CH0_EN_S), \
    }}[(group)][(task)] << (channel))

// Channel events: ID, enable register and bit
#define LEDC_LL_ETM_CHANNEL_EVENT_ID(group, channel, event) \
    ((uint32_t [1][LEDC_CHANNEL_ETM_EVENT_MAX]){{ \
        [LEDC_CHANNEL_ETM_EVENT_FADE_END]          = LEDC_EVT_DUTY_CHNG_END_CH0, \
        [LEDC_CHANNEL_ETM_EVENT_REACH_MAX_OVF_CNT] = LEDC_EVT_OVF_CNT_PLS_CH0, \
    }}[(group)][(event)] + (channel))

#define LEDC_LL_ETM_CHANNEL_EVENT_EN_REG(group, event) \
    ((volatile uint32_t *[1][LEDC_CHANNEL_ETM_EVENT_MAX]){{ \
        [LEDC_CHANNEL_ETM_EVENT_FADE_END]          = (volatile uint32_t *)LEDC_EVT_TASK_EN0_REG, \
        [LEDC_CHANNEL_ETM_EVENT_REACH_MAX_OVF_CNT] = (volatile uint32_t *)LEDC_EVT_TASK_EN0_REG, \
    }}[(group)][(event)])

#define LEDC_LL_ETM_CHANNEL_EVENT_EN_BIT(group, channel, event) \
    ((uint32_t [1][LEDC_CHANNEL_ETM_EVENT_MAX]){{ \
        [LEDC_CHANNEL_ETM_EVENT_FADE_END]          = BIT(LEDC_EVT_DUTY_CHNG_END_CH0_EN_S), \
        [LEDC_CHANNEL_ETM_EVENT_REACH_MAX_OVF_CNT] = BIT(LEDC_EVT_OVF_CNT_PLS_CH0_EN_S), \
    }}[(group)][(event)] << (channel))

// Timer tasks: ID, enable register and bit
#define LEDC_LL_ETM_TIMER_TASK_ID(group, timer, task) \
    ((uint32_t [1][LEDC_TIMER_ETM_TASK_MAX]){{ \
        [LEDC_TIMER_ETM_TASK_RST]    = LEDC_TASK_TIMER0_RST, \
        [LEDC_TIMER_ETM_TASK_RESUME] = LEDC_TASK_TIMER0_RESUME, \
        [LEDC_TIMER_ETM_TASK_PAUSE]  = LEDC_TASK_TIMER0_PAUSE, \
    }}[(group)][(task)] + (timer))

#define LEDC_LL_ETM_TIMER_TASK_EN_REG(group, task) \
    ((volatile uint32_t *[1][LEDC_TIMER_ETM_TASK_MAX]){{ \
        [LEDC_TIMER_ETM_TASK_RST]    = (volatile uint32_t *)LEDC_EVT_TASK_EN1_REG, \
        [LEDC_TIMER_ETM_TASK_RESUME] = (volatile uint32_t *)LEDC_EVT_TASK_EN1_REG, \
        [LEDC_TIMER_ETM_TASK_PAUSE]  = (volatile uint32_t *)LEDC_EVT_TASK_EN1_REG, \
    }}[(group)][(task)])

#define LEDC_LL_ETM_TIMER_TASK_EN_BIT(group, timer, task) \
    ((uint32_t [1][LEDC_TIMER_ETM_TASK_MAX]){{ \
        [LEDC_TIMER_ETM_TASK_RST]    = BIT(LEDC_TASK_TIMER0_RST_EN_S), \
        [LEDC_TIMER_ETM_TASK_RESUME] = BIT(LEDC_TASK_TIMER0_PAUSE_RESUME_EN_S), \
        [LEDC_TIMER_ETM_TASK_PAUSE]  = BIT(LEDC_TASK_TIMER0_PAUSE_RESUME_EN_S), \
    }}[(group)][(task)] << (timer))

// Timer events: ID, enable register and bit
#define LEDC_LL_ETM_TIMER_EVENT_ID(group, timer, event) \
    ((uint32_t [1][LEDC_TIMER_ETM_EVENT_MAX]){{ \
        [LEDC_TIMER_ETM_EVENT_OVF] = LEDC_EVT_TIME_OVF_TIMER0, \
    }}[(group)][(event)] + (timer))

